2021.11.02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-02 Tue 09:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2021.10.26.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2021.11.09.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of October 26 to November 02, 2021.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">Lists.ocaml.org: service temporarily sunsetted</a></li>
<li><a href="#2">Talk at Func Prog Sweden</a></li>
<li><a href="#3">First OPAM releases of Scad_ml and [@@deriving scad]</a></li>
<li><a href="#4">Other OCaml News</a></li>
<li><a href="#org45c5848">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">Lists.ocaml.org: service temporarily sunsetted</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/lists-ocaml-org-service-temporarily-sunsetted/8692/1">https://discuss.ocaml.org/t/lists-ocaml-org-service-temporarily-sunsetted/8692/1</a>
</p>
</div>

<div id="outline-container-org47f42f0" class="outline-3">
<h3 id="org47f42f0">Anil Madhavapeddy announced</h3>
<div class="outline-text-3" id="text-org47f42f0">
<p>
<b>This note does not concern the main OCaml email list, which continues to be available through
<a href="https://sympa.inria.fr/sympa/arc/caml-list/">https://sympa.inria.fr/sympa/arc/caml-list/</a></b>
</p>

<p>
The lists.ocaml.org e-mail service has been going through a rough time in the past few years, with vast swathes of
spam regularly hitting our ingress email server and require manual unblocking every time.  It was set up <a href="https://sympa.inria.fr/sympa/arc/caml-list/2012-12/msg00015.html">back in
2012</a> as an augmentation of the main OCaml mailing
list and really helped with some big projects in the early days (the design of and migration to ppx from camlp4, for
example).  However, in the intervening years e-mail has reduced in importance as a primary community communication
mechanism (as evidenced, for example, in this forum).
</p>

<p>
With the latest spam surge, I've moved the service into read-only mode with all the mailboxes and archives still
available on the website, but with mail delivery and list creation/admin disabled. All existing links should continue
to work to historical links online without change.  The only mailing list on there that was still active to my
knowledge is the opam-commits cron list, which will be replaced by an ocurrent-based deployer for that website
shortly.
</p>

<p>
I hope to bring e-mail back to ocaml.org sometime in 2022, as it's an important communications medium that is highly
accessible. One challenge is spam, and another is the inflexibility of GNU Mailman and its upgrade mechanism
(essentially a manual process from 2 to 3). Therefore, if there is anyone in the community interested in building a
simple e-mail list manager in OCaml, that would be of interest :slight_smile:
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Talk at Func Prog Sweden</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/talk-at-func-prog-sweden/8703/1">https://discuss.ocaml.org/t/talk-at-func-prog-sweden/8703/1</a>
</p>
</div>

<div id="outline-container-orgca29c26" class="outline-3">
<h3 id="orgca29c26">Leonardo Laguna Ruiz announced</h3>
<div class="outline-text-3" id="text-orgca29c26">
<p>
Here's a link for the talk I gave at the Func Prog Sweden meetup. In that talk I show the process we follow some years ago in order to move all our code base to OCaml and why it was an excellent decision.
</p>

<p>
<a href="https://youtu.be/FGXiAARXE2M">https://youtu.be/FGXiAARXE2M</a>
</p>

<p>
<a href="https://www.wolfram.com/system-modeler/">Wolfram System Modeler</a> is a simulation environment that can be used to model multi-domain systems. For example systems composed of electrical, thermal, hydraulic, mechanical, etc, components.
</p>

<p>
One of the main parts of System Modeler is the model compiler (Kernel) which takes models written in the Modelica language and compiles them into efficient simulation executables. This compiler was ported to OCaml by using custom tool that performed the code to code translation of our old code base.
</p>

<p>
Slides <a href="https://a2076202-c90b-450e-901b-cb56c346913c.usrfiles.com/ugd/a20762_adfa899586c7413a8c17f7b708dbc177.pdf">https://a2076202-c90b-450e-901b-cb56c346913c.usrfiles.com/ugd/a20762_adfa899586c7413a8c17f7b708dbc177.pdf</a>
</p>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">First OPAM releases of Scad_ml and [@@deriving scad]</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-first-opam-releases-of-scad-ml-and-deriving-scad/8718/1">https://discuss.ocaml.org/t/ann-first-opam-releases-of-scad-ml-and-deriving-scad/8718/1</a>
</p>
</div>

<div id="outline-container-org8208355" class="outline-3">
<h3 id="org8208355">geoffder announced</h3>
<div class="outline-text-3" id="text-org8208355">
<p>
I'd like to announce the first release onto opam of <a href="https://github.com/namachan10777/scad-ml">Scad_ml</a> and
<a href="https://github.com/geoffder/ppx_deriving_scad">ppx_deriving_scad</a>. The former being a DSL front-end to the
<a href="https://openscad.org/">OpenSCAD</a> solid modelling language, and the latter providing transformation function
generation for custom types (a pattern that I have found useful during my time using <code>Scad_ml</code>.
</p>

<p>
When I decided I wanted to pick up OpenScad, I was pleasantly surprised to discover that the <code>Scad_ml</code> library
already existed on GitHub, credits to <a href="https://github.com/namachan10777">https://github.com/namachan10777</a>. Over time I filled out the rest of the
OpenSCAD language coverage, as well as some additional helpful math, and reorganized things to try and keep it from
getting too messy as more and more was tacked on. Finally, after some help in the ocaml discord (from NULL and
octachron), we also now can track whether shapes are 2D or 3D with minimal changes to the user interface, preventing
misapplications of operations that would otherwise only appear in the OpenSCAD console.
</p>

<p>
The <code>[@@deriving scad]</code> ppx is my solution to make a habit I developed to get around the otherwise fully declarative
nature of working in OpenSCAD more ergonomic. Shapes in OpenSCAD cannot be queried in any way, so upon creation, the
locations of it's vertices or it's origin are not available. Of course, since you created it, you know exactly it's
dimensions, and where you have moved it, but what if you want to use the location of one of it's vertices, wherever
that ends up after a series of transformations? What I did for some time before learning how to write a ppx, was put
the coordinates I cared about into a record with the shape, and mapped over the type (by hand (and regex)) with the
relevant functions (typically transform and rotate). Turns out writing a ppx with <code>Ppxlib</code> and <code>metaquot</code> isn't so
bad, and I really wish I did it sooner!
</p>

<p>
Anyway, to the few of you out there that might use OpenSCAD, I hope that these tools might come in handy!
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">Other OCaml News</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org7ed6cba" class="outline-3">
<h3 id="org7ed6cba">From the ocamlcore planet blog</h3>
<div class="outline-text-3" id="text-org7ed6cba">
<p>
Here are links from many OCaml blogs aggregated at <a href="http://ocaml.org/community/planet/">OCaml Planet</a>.
</p>

<ul class="org-ul">
<li><a href="https://blog.janestreet.com/hiring-a-developer-educator/">Hiring a Developer Educator</a></li>
<li><a href="https://www.ocamlpro.com/2021/10/14/verification-for-dummies-smt-and-induction/">Verification for Dummies: SMT and Induction</a></li>
<li><a href="https://tarides.com/blog/2021-10-14-scop-selected-for-dapsi-phase2">SCoP Passed Phase 1 of the DAPSI Initiative!</a></li>
</ul>
</div>
</div>
</div>




<div id="outline-container-org45c5848" class="outline-2">
<h2 id="org45c5848">Old CWN</h2>
<div class="outline-text-2" id="text-org45c5848">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="orgd6c0c1f">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
